{
    "updated":"2013-03-10T02:00:00.000Z",
  "text": "Above all, the how, is you give your AI a script that you review and customize,\nand it creates the initial code which is similar to a simple wiki that can edit is own code.\n\n---\n\nWhy will anyone will give you money,\nbecause you will customize an AI in a way they need.\n\nFor example, you will do the research, text programming and maintenance,\nto create valid pixel art sprite sheets so that game characters can neatly walk.\n\nYou create such a service out of curiosity, and you take weeks and months,\nthe person who needs sprites, has no time, they have a game to release.\n\nTo them your sprites will be more valuable than you can imagine,\nand that is why they will give you money.\n\nThey give you a little bit of money,\nso that they can make a bunch of money.\n\n---\n\nCredit card processing security is a solved problem,\nbasically you pull a transaction id from your payment processor.\n\nIf a hacker was to intercept it, which is weird,\nbecause it does not need to be saved anywhere.\n\nThey can’t do anything with it, it is meant for one purchase,\nit has an expiration, cancel, and pay.\n\nSo the security is done by the the credit card company,\nyour only real worry is refunds.\n\nBut we fix that as well, you give people free credits,\nso that they can test your product.\n\nThey only give you money when they love it,\nit is a low fee, tested, there will be no charge-backs.\n\n---\n\nThey are buying credits on top of the free ones you give them,\nthese extra credits represent a quota limit.\n\nEventing has a quota limit, you can’t send a gazillion emails,\nyour very ISP won’t let you download a gazillion files.\n\nNe notion of credits makes the quota limit,\ntransparent, and you have multiple levels so that heavy user can pay more.\n\n---\n\nNow lets talk about system architecture,\nthere is an API endpoint, but that is boring.\n\nIf another user of a pixel world compatible system buys your service,\na cute (there is that word again) representative of your system will show up in their lobby.\n\nIt will be a system-compatible character that will notify them about quota,\nanswer billing questions, and alert them to system status, very simple.\n\nIt is a decoration, on top of a standard way of doing things,\nthat allows their other bots to talk to yours.\n\nSo a bot that generates static pixel art characters,\ncan send these images to your bot for converting them to sprite-sheets.\n\nAnd then your bot will pass them on, to a bot that splits the sprite sheets,\ninto animations and posts them for a human to review.\n\n---\n\nI do not think that it is bots all the way down,\nyou will need code, and snippets, but AI will take care of it.\n\n---\n\nSo, this is the part,\nwhere I briefly mention what the system code should be.\n\nI want this to be a wiki,\nbut you should do your thing as learn more.\n\nI continue building in the same spirit,\nthat had me select pixel art.\n\nI just want to say Thank You,\nto the code that made me a better programmer.\n\nThere will be better ways,\nand you should discover them.\n\nI would like this to be a MUD,\na multi user dungeon, but code comes first.\n\nA self editable wiki,\nallow me to give it a name.\n\nI call it MikiMikiMeowMeow,\nthe M in the first Miki stands for Map, the second M stands for MUD.\n\nAnd MeowMeow stands for the fact,\nthat that's what cats do.\n\nThe iki, comes from the word Wiki of course,\nand it means quick, quick to write, iterate, and use.\n\nThis should never be exposed to the internet,\nit must run on your private computer.\n\nThe things you sell, need to be hosted on whatever supports node.js,\nand whatever AI your product uses will be hosted by a company that sells AI.\n\n---\n\nMikiMikiMeowMeow is a prototype,\nwe shouldn't think about security yet, because the program does not exist yet.\n\nThe old way was security first, but in the age of AI,\nwhere MikiMikiMeowMeow can be quickly rewritten, lets not worry about hackers.\n\nBeyond stating that this is private software,\nthat should run on your own computer, and not internet.\n\n---\n\nA self editable wiki, exposes all of its files for editing, including the main file,\nwhich if edited wrong, would prevent the wiki from working.\n\nIt is just magical,\nas magical as an infinite loop.\n\nYou can always ask AI to modify the code,\nand prevent the server.mjs from being edited.\n\nOr introduce permissions or user roles,\nor run every save through a security bot to check for bugs, hacks and bad ideas.\n\nI must remind you and the old programmers reading this,\nthat AI marks a whole new world.\n\nAnd it going to be a whole new word every few months from now on,\nthe old advice does not work anymore – I think that’s wonderful.\n\n---\n\nNot only will MikiMikiMeowMeow allow you to edit articles,\ncode, side menu, footer, text description of code, but also transcude them.\n\nTransclusion is the act, sometimes art,\nof including one page within another.\n\nBut most importantly MikiMikiMeowMeow allows you to\nhold discussions in context of the page you are on.\n\nEspecially with multiple artificial intelligence characters,\nand even trusted humans through their chat avatars on your system.\n\n---\n\nIt is not possible to cover all the features in one text,\nbut they are [tagging], [routing], [history], and bots.\n\nI provide sample implementation of the first three,\nas it may make for an interesting chat with the AI.\n\nBut the bots are too new to fully understand,\nwe can however be sure that server-push is used here.\n\nSo you send a command to the MikiMikiMeowMeow,\nit calls up a remote or [local ai][local-ai] and uses server push to deliver the response.\n\nTo keep things simple, which bots are on the MikiMikiMeowMeow page you are on,\nare stored in a related MikiMikiMeowMeow page, which is server push enabled.\n\nIf you are on a page named router, router/bots,\nwould contain the AI that is present on the page.\n\nThis means that there are sub pages, or special pages,\nfor every page in the MikiMikiMeowMeow.\n\n---\n\nFinally, I just want to clarify, that deploying a business,\nor an AI service, does not include MikiMikiMeowMeow code.\n\nBut this may not mean that the code relies on huge external modules,\n we have entered an age, of purpose built apps.\n\nOnes that run without administrative areas and configuration files even,\nthey are programs written by AI for a specific purpose.\n\nAnd that means, that their source code is a detailed step by step AI prompt,\nin MikiMikiMeowMeow, so it is just a text document.\n\nI think modern LLM can generate secure and valid code,\nbut it is always good to check.\n\nSo another AI, a professional service will need to run a security scan,\nboth externally on your website, and internally on your code.\n\nIt is a good idea,\nwhether it is generated or written manually.\n\nUsing off the shelf content management systems,\nand shopping carts, does not always mean that it is safer.\n\nIt is usually a massive code-base with external dependencies,\nso you have to monitor the content management system, the shopping cart, and program libraries.\n\nIt won’t be long, before someone tests this,\nand determines purpose built AI apps are just safer.\n\nThe code base is so much smaller that it boggles the mind,\nsupply-chain attack is non-existent as AI writes the modules too.\n\nAsking AI to write secure code,\nis probably already safer.\n\nYou are not asking the AI to vibe code,\nyou are using other AI to write detailed and security minded instructions first.\n\n\n[tagging]: files/tags.txt\n[routing]: files/router.txt\n[history]: files/storage.txt\n[local-ai]: https://ollama.com/search"
}
